In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
DROP TABLE IF EXISTS regex_samples;

CREATE TABLE regex_samples (
    id INT AUTO_INCREMENT PRIMARY KEY,
    sample_text VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [3]:
%%sql

INSERT INTO regex_samples (sample_text) VALUES 
('apple'),         
('Banana'),       
('cherry'),        
('date'),          
('elderberry'),   
('fig'),           
('grape'),         
('honeydew'),     
('running'),       
('123abc');

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[]

In [4]:
%%sql
select * from regex_samples

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running'),
 (10, '123abc')]

In [5]:
%%sql
select * from regex_samples 
where sample_text REGEXP '^a';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'apple')]

In [6]:
%%sql
select * from regex_samples 
where sample_text REGEXP 'e$';

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'apple'), (4, 'date'), (7, 'grape')]

In [7]:
%%sql
select * from regex_samples 
where sample_text REGEXP '^[0-9]';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(10, '123abc')]

In [8]:
%%sql
select * from regex_samples 
where sample_text REGEXP 'ing$';

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(9, 'running')]

In [9]:
%%sql
select * from regex_samples 
where sample_text REGEXP '(.)\\1';

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(1, 'apple'), (3, 'cherry'), (5, 'elderberry'), (9, 'running')]

In [10]:
%%sql
select * from regex_samples 
where sample_text REGEXP '^[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/test
9 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running')]

In [11]:
%%sql
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^.{5}$';

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [12]:
%%sql
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP BINARY '[A-Z]';

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.DatabaseError) 3995 (HY000): Character set 'utf8mb4_0900_ai_ci' cannot be used in conjunction with 'binary' in call to regexp_like.
[SQL: SELECT *
FROM regex_samples
WHERE sample_text REGEXP BINARY '[A-Z]';]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [13]:
%%sql
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^(apple|banana)$';

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'apple'), (2, 'Banana')]

In [14]:
%%sql
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[0-9]{3}[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [15]:
%%sql
CREATE TABLE demo_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    full_name VARCHAR(50),
    phone VARCHAR(25),
    email VARCHAR(100),
    date_col VARCHAR(10),   -- Storing as VARCHAR for the demo
    status VARCHAR(20),
    sku VARCHAR(20),
    username VARCHAR(30),
    notes VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [16]:
%%sql
INSERT INTO demo_data (full_name, phone, email, date_col, status, sku, username, notes)
VALUES

('John Smith', 
 '123-456-7890', 
 'john@example.com', 
 '2025-02-07', 
 'pending', 
 'ABCD', 
 'johnsmith', 
 'Ships to CA'),


('Alice Johnson', 
 '(987) 654-3210', 
 'alice@@example.net', 
 '2025-02-07', 
 'inactive', 
 'SKU-123', 
 'alice', 
 'NY location'),


('Bob Williams', 
 '+1-555-123-4567', 
 'bob@sample.org', 
 '20250207', 
 'complete', 
 '1SKU', 
 'bob123', 
 'Shipping to CA'),

('Mary 1 White', 
 '(123) 123-4567', 
 'mary123@example.com', 
 '2025-13-31', 
 'PENDING', 
 'abc-999', 
 'mary_white', 
 'Something about CA or'),


('Mark-Spencer', 
 '1234567890', 
 'mark@example.com', 
 '2024-11-02', 
 'active', 
 'SKU-9999', 
 'mark', 
 'Random note'),


('Jane O''Connor',   -- Note the doubled apostrophe for SQL
 '987-654-3210', 
 'jane.o.connor@example.org', 
 '2024-12-31', 
 'inactive', 
 'ABCDE', 
 'janeO', 
 'Contains CA or NY'),


('Invalid Mail', 
 '000-000-0000', 
 'invalid@@example..com', 
 '2023-01-15', 
 'inactive', 
 'XYZ000', 
 'invalid', 
 'Double @ and dots'),


('NoSpacesHere', 
 '+12-345-678-9012',
 'nospaces@example.co',
 '2025-02-07',
 'pending',
 'SKU999',
 'NoSpaces',
 'Ends with .co domain');

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[]

In [17]:
%%sql
select * from demo_data

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (3, 'Bob Williams', '+1-555-123-4567', 'bob@sample.org', '20250207', 'complete', '1SKU', 'bob123', 'Shipping to CA'),
 (4, 'Mary 1 White', '(123) 123-4567', 'mary123@example.com', '2025-13-31', 'PENDING', 'abc-999', 'mary_white', 'Something about CA or'),
 (5, 'Mark-Spencer', '1234567890', 'mark@example.com', '2024-11-02', 'active', 'SKU-9999', 'mark', 'Random note'),
 (6, "Jane O'Connor", '987-654-3210', 'jane.o.connor@example.org', '2024-12-31', 'inactive', 'ABCDE', 'janeO', 'Contains CA or NY'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]

In [20]:
%%sql
SELECT *
FROM demo_data
WHERE date_col REGEXP '^[0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]$';

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (4, 'Mary 1 White', '(123) 123-4567', 'mary123@example.com', '2025-13-31', 'PENDING', 'abc-999', 'mary_white', 'Something about CA or'),
 (5, 'Mark-Spencer', '1234567890', 'mark@example.com', '2024-11-02', 'active', 'SKU-9999', 'mark', 'Random note'),
 (6, "Jane O'Connor", '987-654-3210', 'jane.o.connor@example.org', '2024-12-31', 'inactive', 'ABCDE', 'janeO', 'Contains CA or NY'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]

In [19]:
%%sql
SELECT *
FROM demo_data
WHERE full_name REGEXP '^[A-Za-z ]+$';

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (3, 'Bob Williams', '+1-555-123-4567', 'bob@sample.org', '20250207', 'complete', '1SKU', 'bob123', 'Shipping to CA'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]